** CC++ language server support

To get language server support (e.g. [[https://github.com/MaskRay/ccls][ccls]]), run:
#+BEGIN_SRC shell :results verbatim
  mkdir -p debug-build
  cmake -H. -B debug-build -DCMAKE_BUILD_TYPE=Debug -DCMAKE_EXPORT_COMPILE_COMMANDS=YES
  ln -s debug-build/compile_commands.json .
#+END_SRC

#+RESULTS:
: -- platform: Linux-6.6.13-amd64
: -- Configuring done (0.2s)
: -- Generating done (0.1s)
: -- Build files have been written to: /home/domi/private/debian-dev/pan-stuff/pan-upstream/debug-build

